class UserInformationController < ApplicationController
  before_action :check_cookies
  def index
    @hobby_infos = hobby_info
    @degree_infos = degree_info
    @height_infos = height_info
    @star_infos = stars
    @address_infos = address
    @work_infos = works
  end

  def get_user_info
    user_info = UserInformation.find_by_user(cookies[:user])
    render :json =>{date: user_info}
  end

  def update
    user_info = UserInformation.find_by_user(cookies[:user])
    p "-----------------user"
    p user_info
    if user_info
      user_info.update(update_info)
      return render :json => {status: 200}
    end
    render :json => {status: 'sss'}
  end

  def delete_user
    UserInformation.find_by_user('zhuxuey').delete
  end

  private

   def update_info
     {
         name: params[:name],
         height: params[:height],
         star: params[:star],
         sex: params[:sex],
         birthday_time: params[:birthday_time].to_time,
         age: Time.new(params[:birthday_time]).year,
         work:params[:work],
         contact: params[:phone],
         address: params[:address],
         degree: params[:degree],
         hobby: params[:hobby]
     }
   end

  def hobby_info
    [
        {kind: '生活', tastes: ['投资理财', '数码产品', '旅游','花草','宠物','做饭','烘焙']},
        {kind: '体育', tastes: ['游泳','跑步','篮球','滑雪','瑜伽','羽毛球','野外露营','台球','健身','足球','爬山']},
        {kind: '休闲', tastes: ['游戏','摄影','钓鱼','歌舞话剧','阅读','电影','音乐','酒吧/KTV','麻将','书法/绘画']},
        {kind: '乐器', tastes: ['钢琴','小提琴','大提琴','吉他','双簧管']}
    ]
  end

  def degree_info
    [
        '高中以下','高中','专科','本科','研究生','博士'
    ]
  end

  def height_info
    [
        '1.50以下','1.51~1.55','1.56~1.60','1.60~1.65','1.66~1.70','1.71~1.75','1.76~1.80','1.81~1.85','1.86以上'
    ]
  end

  def stars
    [
        '白羊座', '金牛座', '双子座', '巨蟹座', '狮子座', '处女座', '天秤座', '天蝎座', '射手座', '摩羯座', '水瓶座', '双鱼座'
    ]
  end

  def address
    [
        {province:"北京市", address: ["东城区", "西城区", "崇文区", "宣武区", "朝阳区", "丰台区", "石景山区", "海淀区", "门头沟区",
                "房山区", "通州区", "顺义区", "昌平区", "大兴区", "怀柔区", "平谷区", "密云县", "延庆县"]},
        {province: "天津市", address: ["和平区", "河东区", "河西区", "南开区", "河北区", "红桥区", "塘沽区", "汉沽区", "大港区",
                "东丽区", "西青区", "津南区", "北辰区", "武清区", "宝坻区", "宁河县", "静海县", "蓟县"]},
        {province:"上海市", address: ["黄浦区", "卢湾区", "徐汇区", "长宁区", "静安区", "普陀区", "闸北区", "虹口区",
                "杨浦区", "闵行区", "宝山区", "嘉定区", "浦东新区", "金山区", "松江区", "青浦区", "南汇区", "奉贤区", "崇明县"]},
        {province: "重庆市", address: ["万州区", "涪陵区", "渝中区", "大渡口区", "江北区", "沙坪坝区", "九龙坡区", "南岸区", "北碚区", "万盛区", "双桥区", "渝北区", "巴南区", "黔江区", "长寿区", "綦江县", "潼南县", "铜梁县",
                                    "大足县", "荣昌县", "璧山县", "梁平县", "城口县", "丰都县", "垫江县", "武隆县", "忠县", "开县", "云阳县", "奉节县", "巫山县",
                                    "巫溪县", "石柱土家族自治县", "秀山土家族苗族自治县", "酉阳土家族苗族自治县", "彭水苗族土家族自治县", "江津市", "合川市", "永川市", "南川市"]},
        {province:"黑龙江省", address: ["哈尔滨市", "齐齐哈尔市", "鸡西市", "鹤岗市", "双鸭山市", "大庆市", "伊春市", "佳木斯市", "七台河市", "牡丹江市", "黑河市", "绥化市", "大兴安岭地区"]},
        {province: "吉林省", address: ["长春市", "吉林市", "四平市", "辽源市", "通化市", "白山市", "松原市", "白城市", "延边朝鲜族自治州"]},
        {province:"辽宁省", address: ["沈阳市", "大连市", "鞍山市", "抚顺市", "本溪市", "丹东市", "锦州市", "营口市", "阜新市", "辽阳市", "盘锦市", "铁岭市", "朝阳市", "葫芦岛市"]},
        {province:"河北省", address: ["石家庄市", "唐山市", "秦皇岛市", "邯郸市", "邢台市", "保定市", "张家口市", "承德市", "沧州市", "廊坊市", "衡水市"]},
        {province:"山西省", address: ["太原市", "大同市", "阳泉市", "长治市", "晋城市", "朔州市", "晋中市", "运城市", "忻州市", "临汾市", "吕梁市"]},
        {province: "青海省", address: ["西宁市", "海东地区", "海北藏族自治州", "黄南藏族自治州", "海南藏族自治州", "果洛藏族自治州", "玉树藏族自治州", "海西蒙古族藏族自治州"]},
        {province:"山东省", address: ["济南市", "青岛市", "淄博市", "枣庄市", "东营市", "烟台市", "潍坊市", "济宁市", "泰安市", "威海市", "日照市", "莱芜市", "临沂市", "德州市", "聊城市", "滨州市", "菏泽市"]},
        {province:"河南省", address: ["郑州市", "开封市", "洛阳市", "平顶山市", "安阳市", "鹤壁市", "新乡市", "焦作市", "濮阳市", "许昌市", "漯河市", "三门峡市", "南阳市", "商丘市", "信阳市", "周口市", "驻马店市", "济源市"]},
        {province:"江苏省", address: ["南京市", "无锡市", "徐州市", "常州市", "苏州市", "南通市", "连云港市", "淮安市", "盐城市", "扬州市", "镇江市", "泰州市", "宿迁市"]},
        {province:"安徽省", address: ["合肥市", "芜湖市", "蚌埠市", "淮南市", "马鞍山市", "淮北市", "铜陵市", "安庆市", "黄山市", "滁州市", "阜阳市", "宿州市", "巢湖市", "六安市","亳州市", "池州市", "宣城市"]},
        {province:"浙江省", address: ["杭州市", "宁波市", "温州市", "嘉兴市", "湖州市", "绍兴市", "金华市", "衢州市", "舟山市", "台州市", "丽水市"]},
        {province:"福建省", address: ["福州市", "厦门市", "莆田市", "三明市", "泉州市", "漳州市", "南平市", "龙岩市", "宁德市"]},
        {province:"江西省", address: ["南昌市", "景德镇市", "萍乡市", "九江市", "新余市", "鹰潭市", "赣州市", "吉安市", "宜春市", "抚州市", "上饶市"]},
        {province:"湖南省", address: ["长沙市", "株洲市", "湘潭市", "衡阳市", "邵阳市", "岳阳市", "常德市", "张家界市", "益阳市", "郴州市", "永州市", "怀化市", "娄底市", "湘西土家族苗族自治州"]},
        {province:"湖北省", address: ["武汉市", "黄石市", "十堰市", "宜昌市", "襄樊市", "鄂州市", "荆门市", "孝感市", "荆州市", "黄冈市", "咸宁市", "随州市", "恩施土家族苗族自治州", "仙桃市", "潜江市", "天门市", "神农架林区"]},
        {province:"广东省", address: ["广州市", "韶关市", "深圳市", "珠海市", "汕头市", "佛山市", "江门市", "湛江市", "茂名市", "肇庆市", "惠州市", "梅州市", "汕尾市", "河源市", "阳江市", "清远市", "东莞市", "中山市", "潮州市", "揭阳市", "云浮市"]},
        {province:"台湾", address: ["台北市", "新北市", "桃园市", "台中市", "台南市", "高雄市", "基隆市", "新竹市", "嘉义市"]},
        {province:"海南省", address: ["海口市", "三亚市", "五指山市", "琼海市", "儋州市", "文昌市", "万宁市", "东方市", "定安县"]},
        {province:"甘肃省", address: ["兰州市", "嘉峪关市", "金昌市", "白银市", "天水市", "武威市", "张掖市", "平凉市", "酒泉市", "庆阳市", "定西市", "陇南市", "临夏回族自治州", "甘南藏族自治州"]},
        {province:"陕西省", address: ["西安市", "铜川市", "宝鸡市", "咸阳市", "渭南市", "延安市", "汉中市", "榆林市", "安康市"]},
        {province: "四川省", address: ["成都市", "自贡市", "攀枝花市", "泸州市", "德阳市", "绵阳市", "广元市", "遂宁市", "内江市", "乐山市", "南充市", "眉山市", "宜宾市", "广安市", "达州市",
                                    "雅安市", "巴中市", "资阳市", "阿坝藏族羌族自治州", "甘孜藏族自治州", "凉山彝族自治州"]},
        {province:"贵州省", address: ["贵阳市", "六盘水市", "遵义市", "安顺市", "铜仁地区", "黔西南布依族苗族自治州", "毕节地区", "黔东南苗族侗族自治州", "黔南布依族苗族自治州"]},
        {province: "云南省", address: ["昆明市", "曲靖市", "玉溪市", "保山市", "昭通市", "丽江市", "思茅市", "临沧市", "楚雄彝族自治州", "红河哈尼族彝族自治州", "文山壮族苗族自治州",
                                    "西双版纳傣族自治州", "大理白族自治州", "德宏傣族景颇族自治州", "怒江傈僳族自治州", "迪庆藏族自治州"]},
        {province:"内蒙古自治区", address: ["呼和浩特市", "包头市", "乌海市", "赤峰市", "通辽市", "鄂尔多斯市", "呼伦贝尔市", "巴彦淖尔市", "乌兰察布市", "兴安盟", "锡林郭勒盟", "阿拉善盟"]},
        {province:"新疆维吾尔自治区", address: ["乌鲁木齐市", "克拉玛依市", "吐鲁番地区", "哈密地区", "昌吉回族自治州", "博尔塔拉蒙古自治州", "巴音郭楞蒙古自治州", "阿克苏地区", "克孜勒苏柯尔克孜自治州", "喀什地区", "和田地区", "伊犁哈萨克自治州", "塔城地区", "阿勒泰地区", "石河子市", "阿拉尔市", "图木舒克市", "五家渠市"]},
        {province:"西藏自治区", address: ["拉萨市", "昌都地区", "山南地区", "日喀则地区", "那曲地区", "阿里地区", "林芝地区"]},
        {province:"宁夏回族自治区", address: ["银川市", "石嘴山市", "吴忠市", "固原市", "中卫市"]},
        {province:"广西壮族自治区", address: ["南宁市", "柳州市", "桂林市", "梧州市", "北海市", "防城港市", "钦州市", "贵港市", "玉林市", "百色市", "贺州市", "河池市", "来宾市", "崇左市"]},
        {province:"香港", address: ["香港岛", "九龙", "新界"]},
        {province:"澳门", address: ["花地玛堂区（北区）", "圣安多尼堂区（花王堂区）", "大堂区", "望德堂区", "风顺堂区", "嘉模堂区（氹仔）", "圣方济各堂区（环路）", "路氹城", "澳门新城区"]}
    ]
  end

  def works
    [{kind:"经营管理类", work: ["总裁/总经理/CEO", "行政总监", "技术总监CTO/总工", "人力资源总监", "财务总监CFO/总会计师", "首席信息官CIO", "首席运营官/COO", "市场/营销总监", "联盟经理"]}
    ]
  end
end
